SET NAMES UTF8;
DROP DATABASE IF EXISTS `tb`;
CREATE DATABASE `tb` DEFAULT CHARACTER SET UTF8;
USE `tb`;
CREATE TABLE `user`(
    `id` INT  KEY AUTO_INCREMENT COMMENT "id",
    `name` VARCHAR(30) COMMENT "姓名",
    `age` VARCHAR(30) COMMENT "年龄",
    `sex` TINYINT(30) COMMENT "性别0代表男,1代表女",
    `job` VARCHAR(30) COMMENT "工作",
    `addr` VARCHAR(255) COMMENT "地址",
    `sal` INT(255) COMMENT "工资"
) DEFAULT CHARACTER SET UTF8 COMMENT "测试表";
INSERT INTO `user` (`name`,`age`,`sex`,`job`,`addr`,`sal`)
VALUES
('张三',21,1,'java','北京市东城区',14000),
('tom',21,1,'web','北京市东城区',4000),
('luck',21,0,'php','天津红旗区',8000),
('张四',35,1,'web','天津市河南区',6000),
('王五',21,0,'c++','北京市延庆区',9000),
('赵六',54,1,'c++','北京市海淀区',12000),
('宋琦',31,0,'net','北京市东城区',20000),
('王霸',20,1,'node','北京市海淀区',1500),
('天霸',40,0,'node','北京市朝阳区',11000),
('动霸',78,0,'vue','北京市朝阳区',13000),
('皮皮',36,0,'node','北京市东城',8000),
('喵喵',45,0,'web','东京市东城',9000),
('麦麦',35,1,'web','南京市西城',10000),
('悦悦',12,1,'php','天津市宝坻区',15000),
('老吴',56,1,'vue','上海浦东区',24000),
('阿黄',91,1,'php','上海市浦西区',18000),
('王宁',81,0,'c++','北程市玄武区',17000),
('柠男1',56,0,'c++','北汾县西城区',16000),
('柠男2',23,0,'web','北京西城区',14000),
('柠男3',87,0,'c++','北京东城区',3000),
('柠男4',46,0,'php','南京市西城',2000),
('张三',34,0,'php','北汾县西城区',8000),
('张思',36,0,'c++','天津市宝坻区',5000),
('王五',56,0,'php','北汾县西城区',13500),
('宋琦',48,1,'web','北京东城区',6000),
('李柳',56,0,'c++','北汾县西城区',16000),
('岁吉',45,1,'java','北京市东城区',17000),
('shenge',45,1,'java','南京市东城区',17000),
('xiaoyi',45,1,'php','%市%%区',100);