<template><div><table aligin="center" >
<tr >
<td rowspan="3" width="256px"><img src="/images/inkDou.jpg" ></td>
<td><h3><i>inkDou</i></h3></td>
</tr>
<tr>
<td>一名从事设计行业，热爱机车、跑步的中年大叔</td>
</tr>
<tr>
<td>
<!-- <h3>感言</h3>岁月无敌，随着时间的流逝，青春、体力、健康、精神、精力、气魄、志向、抱负，渐渐地衰退下去，力不从心的感觉，时常会有发生。在时间滔滔而下的强大的洪流里，感觉只能顺水行舟、随波逐流，青年时代激流勇进、逆流而上的气魄和力量已经不再存在。时间，是最严厉的老人，他沉默平静、一言不发却威严常在、不容置疑。<br><br>
曾经志存高远，曾经满怀改变社会、指点江山、造福人类的理想，最后却陷落在人性的缺憾、邪恶与社会的堕落与惯性里，个人根本无力回天。人生的改善，已经微乎其微，不可过多地期望，社会的改进，更是举步维艰、谈何容易！<br><br>
怎奈还有倔强和激情，于是出于个人的爱好和技能的补充，2022年我开始了前端技术的学习，为了能把知识点储存，方便实时回顾与总监，便建了这个站。<br><br> -->
</td>
</tr>
</table>
<h2 id="其他" tabindex="-1"><a class="header-anchor" href="#其他" aria-hidden="true">#</a> 其他</h2>
<p><RouterLink to="/CODE/INTERVIEW/">面试题合集</RouterLink></p>
</div></template>
